app/controllers/chefs_controller.rb

  def index
    @chefs = Chef.paginate(page: params[:page], per_page: 5);
---
SELECT  "chefs".* FROM "chefs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "chefs"

  def create
    @chef = Chef.new(chef_params)
    if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def show

    @chef_recipes = @chef.recipes.paginate( page: params[:page], per_page: 5)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["chef_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]

  def set_chef
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]